import telegram
from telegram.ext import Application, CommandHandler, MessageHandler, filters
from datetime import datetime, timedelta

# --- ⚙️ Основа нашего бота ⚙️ ---

TELEGRAM_BOT_TOKEN = "8139998528:AAFka51sXJ6j2uSGCaFYO6obYzD2n6YUQ2o"
START_DATE_STR = "06-12-2025"  # Когда бросили курить?
CIGS_PER_PACK = 20  # Сколько сигарет в пачке?
CIGS_PER_DAY = 7  # Кол-во сигарет в день
PACK_COST = 1100  # Стоимость пачки
CURRENCY = "KZT"  # Валюта

# -----------------------------------------------------
# Преобразование строки даты в объект datetime
START_DATE = datetime.strptime(START_DATE_STR, "%d-%m-%Y")

#  Список достижений, привязанных к прошедшему времени (в часах)
ACHIEVEMENTS = [
    (2, "🎉 **Прошло 2 часа!** Уровень никотина в крови упал вдвое. Тело начинает очищаться."),
    (8,
     "💪 **Прошло 8 часов!** Уровень угарного газа (CO) в крови снизился до нормы. Кровь стала лучше насыщаться кислородом."),
    (24, "💨 **Прошло 24 часа!** Риск сердечного приступа начал снижаться."),
    (48,
     "👅 **Прошло 2 дня!** Улучшается способность чувствовать вкус и запах. Нервные окончания начинают восстанавливаться."),
    (72, "🔋 **Прошло 3 дня!** Дыхание становится легче. Уровень энергии повышается."),
    (336, "🌱 **Прошло 2 недели!** Улучшается кровообращение. Ходить становится легче. Улучшается функция легких."),
    (1440, "🥳 **Прошел 2 месяц!** Кашель и одышка уменьшаются. Легочная ткань начинает активно восстанавливаться."),
    (4320, "🥳 **Прошло 6 месяцев!** Значительное снижение риска заболеваний."),
    (8760, "🏆 **Прошел 1 год!** Риск ишемической болезни сердца снизился вдвое по сравнению с курильщиком."),
]


# --- 📚 ФУНКЦИИ РАСЧЕТА (ЛОГИКА) ---

def calculate_progress():
    """Рассчитывает время, сигареты и деньги с момента отказа"""

    # 1. Расчет времени (timedelta)
    now = datetime.now()
    time_delta = now - START_DATE

    total_seconds = int(time_delta.total_seconds())

    # Если дата начала в будущем
    if total_seconds < 0:
        return None, None, None, None, None

        # Перевод секунд в дни/часы/минуты
    days = time_delta.days
    # Общее количество часов с начала
    total_hours = total_seconds // 3600
    minutes = (total_seconds % 3600) // 60

    # 2. Расчет сигарет и денег

    # Сигарет в час: CIGS_PER_DAY / 24
    cigs_saved = round(total_hours * (CIGS_PER_DAY / 24))

    # Стоимость одной сигареты: PACK_COST / CIGS_PER_PACK
    money_saved = round(cigs_saved * (PACK_COST / CIGS_PER_PACK), 2)

    return days, total_hours, minutes, cigs_saved, money_saved
